[
  {
    "title": "1ο Εξάμηνο",
    "information" : "Σε αυτό το εξάμηνο θα πρέπει να επιλέξετε <b>ένα (1) απο τα μαθήματα επιλογής</b> (σημειωμένα με κόκκινο χρώμα).",
    "lessons": [
      {
        "title": "Εισαγωγή στην Επιστήμη των Υπολογιστών",
        "code": "ΜΠΠΛΕΥ01",
        "mandatory": true,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      },
      {
        "title": "Αρχές Προγραμματισμού – Γλώσσα C, C++",
        "code": "ΜΠΠΛΑΠ01",
        "mandatory": true,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Βασικός στόχος είναι να μάθει ο σπουδαστής να αναλύει προβλήματα και να προγραμματίζει την επίλυσή τους με βασικό εργαλείο την γλώσσα C. Επιπρόσθετος στόχος είναι η αριστοποίηση των προγραμμάτων και το πέρασμα από τον παραδοσιακό προγραμματισμό στον αντικειμενοστρεφή και στον μεταλλακτικό προγραμματισμό.\n\nΠεριεχόμενο Μαθήματος\nΑρχές Προγραμματισμού. Χώροι Δεδομένων. Ανάλυση προβλήματος, Σχεδιασμός, Αναλυτικός αλγόριθμος και Ανάπτυξη προγράμματος. Βασικές δομές της C. Τελεστές. Εντολές C. Συναρτήσεις. Εισαγωγή στον αντικειμενοστρεφή προγραμματισμό με C++. Αρχεία. Ασκήσεις/Εφαρμογές."
      },
      {
        "title": "Δομές Δεδομένων",
        "code": "ΜΠΠΛΔΔ01",
        "mandatory": true,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      },
      {
        "title": "Γλώσσες Προγραμματισμού και Μεταγλωττιστές",
        "code": "ΜΠΠΛΓΠΜ01",
        "mandatory": true,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Ύλη: Εισαγωγή στις Γλώσσες Προγραμματισμού. Ταξινομήσεις γλωσσών προγραμματισμού (διαδικαστικές-αντικειμενοστρεφείς, επίπεδα γλωσσών κ.λπ.). Παραδείγματα σύνταξης γλώσσας προγραμματισμού Pascal. Τρόποι προσδιορισμού σύνταξης γλωσσών προγραμματισμού (BNF, EBNF, συντακτικά διαγράμματα). Στοιχεία Θεωρίας Γλωσσών, κανόνες παραγωγής, συντακτικά δένδρα, γραμματικές, η ταξινόμηση Chomsky, κανονικές εκφράσεις, πεπερασμένα αυτόματα, αυτόματα στοίβας, μέσα για τον ορισμό σημασιολογικών προδιαγραφών. Εισαγωγή στη μεταγλώττιση, ανάλυση-σύνθεση, Τ-διαγράμματα, διερμηνείς, συμβολομεταφραστές. Λεκτική ανάλυση, ομάδες, λεκτικές μονάδες, πρότυπα, ανάνηψη από λάθη, LEX προγράμματα. Συντακτική και Σημασιολογική Ανάλυση, ανάλυση από πάνω προς τα κάτω, γραμματικές LL(k),  LR(k), συντακτικοί αναλυτές αναδρομικής κατάβασης,  υλοποίηση συντακτικού αναλυτή με χρήση YACC, Παραγωγή Κώδικα, ενδιάμεσες αναπαραστάσεις."
      },
      {
        "title": "Λειτουργικά Συστήματα",
        "code": "ΜΠΠΛΛΣ01",
        "mandatory": true,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα περιλαμβάνει τη θεωρητική και πρακτική μελέτη των Λειτουργικών Συστημάτων. Η ύλη καλύπτει τις ακόλουθες ενότητες.\n\nΕισαγωγή στα λειτουργικά συστήματα: Βασικές έννοιες, κλήσεις συστήματος, βασικές αφαιρέσεις των λειτουργικών συστημάτων, δομή, αρχιτεκτονική και εξέλιξη των λειτουργικών συστημάτων.\nΣύστημα αρχείων: Αρχεία, κατάλογοι, κλήσεις συστήματος για αρχεία και καταλόγους, ζητήματα δομής και υλοποίησης.\nΔιεργασίες και νήματα: Διεργασίες και νήματα, επικοινωνία μεταξύ των διεργασιών, αλγόριθμοι και βασικά προβλήματα δια-διεργασιακής επικοινωνίας.\nΔιαχείριση μνήμης: Δομή και διαχείριση μνήμης, εναλλαγή μνήμης, εικονική μνήμη, σελιδοποίηση, αλγόριθμοι εναλλαγής σελίδας μνήμης, θέματα βελτιστοποίησης. \nΤο μάθημα περιλαμβάνει εργαστήριο πρακτικών θεμάτων σε Unix/Linux."
      },
      {
        "title": "Ειδικά Κεφάλαια Μαθηματικών",
        "code": "ΜΠΠΛΕΚΜ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      },
      {
        "title": "Διακριτά Μαθηματικά",
        "code": "ΜΠΠΛΔΜ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Τα Διακριτά Μαθηματικα θεωρούνται τα Μαθηματικά της Πληροφορικής.\n\nΔιαπραγματεύονται διάφορες δομές σε πεπερασμένα σύνολα, των οποίων τα στοιχεία διακρίνονται σύμφωνα με ορισμένα χαρακτηριστικά.\n\nΤο μάθημα αποτελεί μια σύνθεση φαινομενικά διαφορετικών θεμάτων, που όμως τελικά συνδέονται και έχουν εφαρμογές στην Πληροφορική.\n\nΣυγκεκριμένα αναπτύσσονται στοιχεία από τη Θεωρία Συνόλων, τη Συνδυαστική, τη Θεωρία Γραφημάτων, την Άλγεβρα Boole και τη Θεωρία Αυτομάτων.\n\nΌλα τα θέματα που αναπτύσσονται στα πλαίσια του μαθήματος αυτού εφαρμόζονται σε διάφορα πεδία της Πληροφορικής: Τα Σύνολα είναι απαραίτητα για τη σωστή θεμελίωση πολλών εννοιών. Η Συνδυαστική έχει εφαρμογές στη Θεωρία Κωδίκων και στην Κρυπτογραφία. Τα Γραφήματα εφαρμόζονται κυρίως στις Δομές Δεδομένων, στους Αλγόριθμους και στη Θεωρία Αποφάσεων. Η Άλγεβρα Boole είναι άμεσα συνδεδεμένη με τον υπολογιστή και χρησιμοποιείται σε μαθήματα που έχουν σχέση με το υλικό (hardware) και τέλος τα Αυτόματα χρησιμοποιούνται μεταξύ άλλων στους Αλγόριθμους και στους Μεταγλωττιστές.\n\nΠαρουσιάζονται επίσης διάφορες εφαρμογές και ασκήσεις.\nΔεν υπάρχει προαπαιτούμενη ύλη. Αρχίζουμε τη θεωρία από την αρχή."
      },
      {
        "title": "Λογικός Προγραμματισμός",
        "code": "ΜΠΠΛΛΠ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Ο Λογικός Προγραμματισμός είναι η προσέγγιση εκείνη μεταξύ των γλωσσών προγραμματισμού που ασχολείται με την ανάπτυξη ευφυούς λογισμικού χρησιμοποιώντας τεχνικές αναπαράστασης και συλλογιστικής της Προτασιακής και Κατηγορηματικής Λογικής. Η γλώσσα προγραμματισμού Prolog είναι ο κυριότερος, ίσως, εκπρόσωπος της κατηγορίας αυτής γλωσσών προγραμματισμού και μπορεί να χρησιμοποιηθεί για την προτυποποίηση προβλημάτων και τη γρήγορη ανάπτυξη εφαρμογών. Ο λογικός προγραμματισμός συνδέεται άμεσα με τα Νοήμονα Υπολογιστικά Συστήματα, τα οποία είναι συστήματα που επιδεικνύουν χαρακτηριστικά που σχετίζουμε με την έννοια της νοημοσύνης όπως αυτή εκδηλώνεται μέσα από την ανθρώπινη συμπεριφορά. Τέτοια χαρακτηριστικά είναι η εξαγωγή συμπερασμάτων, η επίλυση προβλημάτων, η αντίληψη μέσω όρασης και άλλων αισθήσεων, η μάθηση και η κατανόηση φυσικής γλώσσας. Ο χώρος αυτός έχει μεγάλο εύρος, περιλαμβάνει θέματα όπως τα πολυπρακτορικά συστήματα, τα έμπειρα συστήματα, τα ευφυή εικονικά περιβάλλοντα και η ρομποτική, ενώ έχει πλήθος πρακτικών εφαρμογών σε τομείς όπως η επιχειρησιακή έρευνα, η διαγνωστική ιατρική, η προσομοίωση, η παροχή προσωποποιημένων υπηρεσιών και η επιστημονική έρευνα."
      }
    ]
  },
  {
    "title": "2ο Εξάμηνο",
    "information" : "Σε αυτό το εξάμηνο θα πρέπει να επιλέξετε <b>ένα (1) απο τα μαθήματα επιλογής</b> (σημειωμένα με κόκκινο χρώμα).",
    "lessons": [
      {
        "title": "Αντικειμενοστρεφής Προγραμματισμός -Τεχνολογίες Διαδικτύου",
        "code": "ΜΠΠΛΑΝΠ01",
        "mandatory": true,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      },
      {
        "title": "Ταχεία Ανάπτυξη Εφαρμογών",
        "code": "ΜΠΠΛΤΑΕ01",
        "mandatory": true,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      },
      {
        "title": "Βάσεις και Αποθήκες Δεδομένων",
        "code": "ΜΠΠΛΒΔ01",
        "mandatory": true,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      },
      {
        "title": "Τεχνητή Νοηµοσύνη – Έµπειρα Συστήµατα",
        "code": "ΜΠΠΛΤΧ01",
        "mandatory": true,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Στόχος του μαθήματος είναι η εξοικείωση των φοιτητών με τις βασικές θεωρητικές αρχές της Τεχνητής Νοημοσύνης και η γνωριμία με τις διάφορες πλευρές της και τις εφαρμογές τους, με έμφαση στην αναπαράσταση γνώσης, τους αλγορίθμους επίλυσης προβλημάτων, το σχεδιασμό ενεργειών, τους ευφυείς πράκτορες και τα έμπειρα συστήματα. Ιδιαίτερο βάρος θα δοθεί στις διαδικασίες σχεδιασμού, υλοποίησης, διαχείρισης και λειτουργίας των έμπειρων συστημάτων, καθώς και στις διάφορες χρήσεις και εφαρμογές τους."
      },
      {
        "title": "Αλληλεπίδραση Ανθρώπου – Υπολογιστή",
        "code": "ΜΠΠΛΑΑΥ01",
        "mandatory": true,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      },
      {
        "title": "Θεωρία και Εφαρµογές Γραφηµάτων",
        "code": "ΜΠΠΛΘΕΓ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Τα γραφήματα (σημεία ενωμένα με δεσμούς ή τόξα) σχηματοποιούν (κάνουν πιο εύληπτα) διάφορα προβλήματα. Για την επίλυση των προβλημάτων αναπτύχθηκε η σχετική θεωρία. (Τα γραφήματα δεν έχουν σχέση με τις γραφικές παραστάσεις συναρτήσεων ή με τα γραφήματα της Στατιστικής.)"
      },
      {
        "title": "Γραµµικός Προγραµµατισµός",
        "code": "ΜΠΠΛΓΠ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      },
      {
        "title": "Πολυµεσικά Σήµατα και Συστήµατα",
        "code": "ΜΠΠΛΠΣΣ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      },
      {
        "title": "Ειδικά Θέµατα Συνδυαστικής Ανάλυσης",
        "code": "ΜΠΠΛΕΘΣΑ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      }
    ]
  },
  {
    "title": "3ο Εξάμηνο",
    "information" : "Σε αυτό το εξάμηνο θα πρέπει να επιλέξετε <b>ένα (1) απο τα μαθήματα επιλογής</b> (σημειωμένα με κόκκινο χρώμα).",
    "lessons": [
      {
        "title": "Τεχνολογία Λογισµικού",
        "code": "ΜΠΠΛΤΛ01",
        "mandatory": true,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Μοντέλα κύκλου ζωής λογισμικού: Μοντέλο καταρράκτη, Rational Unified Process.\nΠροϋπολογισμός κόστους λογισμικού.\nΑνάλυση απαιτήσεων: Δομημένη Ανάλυση και Αντικειμενοστρεφής Ανάλυση. Άλλες Μεθοδολογίες Ανάλυσης.\nΣχεδιασμός: Αρχιτεκτονικός σχεδιασμός, λεπτομερής σχεδιασμός. Δομημένος σχεδιασμός. Αντικειμενοστρεφής σχεδιασμός. Άλλες μεθοδολογίες σχεδιασμού.\n Η αντικειμενοστρεφής γλώσσα μοντελοποίησης UML\n\n·         Υλοποίηση και γλώσσες προγραμματισμού.\nΈλεγχος, συντήρηση και εργαλεία CASE.\nΧαρακτηριστικά ποιότητας λογισμικού."
      },
      {
        "title": "Αναγνώριση Προτύπων",
        "code": "ΜΠΠΛΑΠ01",
        "mandatory": true,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      },
      {
        "title": "Αλγόριθµοι",
        "code": "ΜΠΠΛΑ01",
        "mandatory": true,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      },
      {
        "title": "∆ίκτυα Υπολογιστών",
        "code": "ΜΠΠΛΔΥ01",
        "mandatory": true,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Σκοπός και εφαρμογές των δικτύων υπολογιστών. Τυποποίηση και πρότυπα OSI/ISO και TCP/IP. Φυσικό επίπεδο, επίπεδο συνδέσμου, επίπεδο δικτύου, επίπεδο μεταφοράς, επίπεδο συνόλου, επίπεδο παρουσίασης, επίπεδο εφαρμογών: Πρότυπα, επίδοση, εφαρμογές. Τοπικά δίκτυα. Δίκτυα ευρείας ζώνης (B-ISDN, ATM). Ασύρματα δίκτυα."
      },
      {
        "title": "Συστήματα Λογισμικού Διαχείρισης Επιχειρησιακών Πόρων (ERP)",
        "code": "ΜΠΠΛΣΛΔ01",
        "mandatory": true,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα αποσκοπεί στην κατανόηση των Πληροφοριακών Συστημάτων (ΠΣ). Καλύπτει το θέμα τόσο από διοικητική και οργανωτική διάσταση (Management Information Systems, MIS), όσο και από σχεδιαστική και τεχνική διάσταση (Systems Analysis & Design, SAD). Οι φοιτητές θα γνωρίσουν ποια είναι τα συστατικά στοιχεία ενός ΠΣ και ποιοι είναι οι κυριότεροι τύποι πληροφοριακών συστημάτων που χρησιμοποιούνται από τους οργανισμούς και τις επιχειρήσεις σήμερα. Οι φοιτητές θα γνωρίσουν τις μεθοδολογίες ανάλυσης απαιτήσεων και το μετασχηματισμό τους σε σχεδίαση συστήματος. Τέλος, θα μάθουν να χρησιμοποιούν τη UML για να κατασκευάζουν διάφορα μοντέλα ΠΣ και θα δουν πώς αυτά οδηγούν την ανάπτυξη του λογισμικού. "
      },
      {
        "title": "Συστήµατα Υποστήριξης Αποφάσεων",
        "code": "ΜΠΠΛΣΥΑ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      },
      {
        "title": "Ανάπτυξη Λογισμικού για Κινητές Συσκευές",
        "code": "ΜΠΠΛΑΛΟΓ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Αντικείμενο του μαθήματος είναι η ανάπτυξη εφαρμογών οι οποίες μπορούν να εκτελεστούν από σύγχρονες κινητές συσκευές (smartphones) με ενσωματωμένο λειτουργικό σύστημα. Οι εφαρμογές αυτές δύναται να λειτουργήσουν τόσο στα σύγχρονα «έξυπνα» τηλέφωνα \"smartphones\", όσο και σε άλλες «κινητές» συσκευές, οι οποίες έχουν κάνει την εμφάνισή τους τα τελευταία χρόνια και χρησιμοποιούν λειτουργικό σύστημα (Tablets, Wearables). Στο μάθημα αναλύονται περιληπτικά τα δημοφιλέστερα λειτουργικά συστήματα κινητών συσκευών, καθώς και τα εργαλεία ανάπτυξης εφαρμογών σε αυτά, ωστόσο η ύλη περιλαμβάνει κυρίως τη χρήση της αντικειμενοστρεφούς γλώσσας προγραμματισμού Java, για την ανάπτυξη εφαρμογών σε κινητές συσκευές υπό το λειτουργικό σύστημα Android. Ενδεικτικά, η ανάπτυξη των mobile apps θα υλοποιηθεί με τη χρήση του περιβάλλοντος ανάπτυξης λογισμικού Android Studio. Η Java είναι η πρώτη σε χρήση γλώσσα προγραμματισμού παγκοσμίως (δεδομένα 2019), ενώ το λειτουργικό σύστημα Android κατέχει το μεγαλύτερο μερίδιο της παγκόσμιας αγοράς των smartphones (δεδομένα 2019). Ο μεταπτυχιακός φοιτητής, ο οποίος θα έχει ολοκληρώσει με επιτυχία το μάθημα, θα είναι σε θέση:\n\n- Nα χρησιμοποιεί το εργαλείο Android Studio για την ανάπτυξη κινητών εφαρμογών\n- Να αναπτύσσει native mobile apps κάνοντας χρήση του Android SDK\n- Να χρησιμοποιεί τοπικές (SQLite) βάσεις δεδομένων\n- Να χρησιμοποιεί τις πλέον σύγχρονες υπηρεσίες Cloud και Mobile backend as a service που παρέχει η Firebase\n- Επιπλέον το μάθημα καλύπτει και την ύλη που αφορά στους αισθητήρες των κινητών συσκευών, στις υπηρεσίες γεοεντοπισμού και σε πλήθος άλλων προχωρημένων τεχνικών προγραμματισμού (asynchronous programming, android services, broadcast receivers, android intents)."
      },
      {
        "title": "Γραφικά µε Υπολογιστές – Εικονική Πραγματικότητα",
        "code": "ΜΠΠΛΓΡΥ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Τα Γραφικά με Υπολογιστές ­είναι το επιστημο­νικό πεδίο με αντικείμενο τη δημιουργία οπτικών απεικονίσεων με τη βοήθεια ηλεκτρονικών υπολογιστών. Τα Γραφικά με Υπολογιστές βασίζονται σε συγκεκριμένο μαθηματικό υπόβαθρο, ενώ έχουν πολλές πτυχές όπως ο φωτορεαλισμός, τα διαγραμματικά γραφικά, η κίνηση (animation), τα τρισδιάστατα γραφικά, κ.ά. Από την άλλη πλευρά, η Εικονική Πραγματικότητα αφορά την αναπαράσταση κόσμων με τη βοήθεια ηλεκτρονικών υπολογιστών. Τα Γραφικά με Υπολογιστές διαδραματίζουν βασικό ρόλο στην Εικονική Πραγματικότητα, ενώ άλλα θέματα εξ’ ίσου σημαντικά είναι ο ήχος και ­το υλικό αλληλεπίδρασης με τους χρήστες. Η Εικονική Πραγματικότητα, κυρίως μέσω των Ευφυών Εικονικών Συστημάτων, έχει πλήθος εφαρμογών στην εκπαίδευση, την ψυχαγωγία, την προσομοίωση, την αλληλεπίδραση ανθρώπου – υπολογιστή και την επιστημονική έρευνα.\n\nΣτόχος του μαθήματος είναι η εξοικείωση των φοιτητών με τις βασικές θεωρητικές αρχές στις οποίες στηρίζονται τα Γραφικά με Υπολογιστές, με τη γλώσσα VRML, καθώς και με την δημιουργία και την διαχείριση εικονικών κόσμων σε Second Life και OpenSimulator."
      },
      {
        "title": "Κρυπτογραφία",
        "code": "ΜΠΠΛΚΡ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Η κρυπτογραφία αποτελεί τα θεμέλια της ασφάλειας υπολογιστικών συστημάτων. Βασικός σκοπός είναι οι φοιτητές να αποκτήσουν το απαραίτητο υπόβαθρο για την κατασκευή προγραμμάτων ή συσκευών οι οποίεςανταλλάσσουν δεδομένα με ασφάλεια μέσα σε μη ασφαλείς χώρους όπως το διαδίκτυο.\n\nΣτα πλαίσια λοιπόν του μαθήματος, οι φοιτητές αρχικά κατανοούν τις βασικές αρχές της κρυπτογραφίας, θα γνωρίσουν τις νέες χρήσεις και τάσεις της κρυπτογραφίας, ενώ μέσα από το εργαστήριο θα μπορέσουν να εμπεδώσουν σε βάθος"
      }
    ]
  },
  {
    "title": "4ο Εξάμηνο",
    "information" : "Σε αυτό το εξάμηνο θα πρέπει να επιλέξετε <b>δύο (2) απο τα μαθήματα επιλογής</b> (σημειωμένα με κόκκινο χρώμα).",
    "lessons": [
      {
        "title": "Μεταπτυχιακή Διατριβή",
        "code": "",
        "mandatory": true,
        "hours": 0,
        "ects": 20,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      },
      {
        "title": "Ασφάλεια Πληροφοριών",
        "code": "ΜΠΠΛΑΠΛ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      },
      {
        "title": "Σύγχρονα Τηλεπικοινωνιακά Δίκτυα και Υπηρεσίες",
        "code": "ΜΠΠΛΣΤΔΙ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      },
      {
        "title": "Εικονικές Επιχειρήσεις",
        "code": "ΜΠΠΛΕΕ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      },
      {
        "title": "Ηλεκτρονικό Επιχειρείν",
        "code": "ΜΠΠΛΗΕ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      },
      {
        "title": "Ιατρική Πληροφορική",
        "code": "ΜΠΠΛΙΠ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Διαχείριση και επεξεργασία ιατρικής πληροφορίας\n- Βάσεις ιατρικών δεδομένων\nΗλεκτρονικοί ιατρικοί φάκελοι\n- Διοικητικές εφαρμογές διαχείρισης πόρων και μηχανογράφηση\n- Τηλεϊατρική\n- Τηλεϊατρική και Τηλεεκπαίδευση\n- Συστήματα Τηλεπαρακολούθησης ασθενών\n- Αλγόριθμοι μηχανικής μάθησης για επεξεργασία ιατρικών δεδομένων\n- Απεικόνιση βιοσημάτων"
      },
      {
        "title": "Ναυτιλιακή Πληροφορική",
        "code": "ΜΠΠΛΝΑΠ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      },
      {
        "title": "Νομική Πληροφορική",
        "code": "ΜΠΠΛΝΠ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      },
      {
        "title": "Περιβαλλοντική Πληροφορική",
        "code": "ΜΠΠΛΠΠ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Αποθήκευση, Ανάκτηση και Επεξεργασία ποικίλων οικολογικών δεδομένων\n- Βάσεις Οικολογικών Δεδομένων για Γεωγραφικά Συστήματα Πληροφοριών\n- Τα Γεωγραφικά Συστήματα Πληροφοριών ως εργαλείο για την προστασία του περιβάλλοντος\n- Γνωριμία με μερικά βασικά οικολογικά μοντέλα\n- Σύνδεση των οικολογικών μοντέλων με τις βάσεις οικολογικών δεδομένων"
      },
      {
        "title": "Πληροφορική στην Εκπαίδευση",
        "code": "ΜΠΠΛΠΕ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      },
      {
        "title": "Γεωπληροφορική",
        "code": "ΜΠΠΛΣΓΠ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      },
      {
        "title": "Συστημική Ανάλυση",
        "code": "ΜΠΠΛΣΑΝ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      },
      {
        "title": "Ανάλυση Εικόνας και Εφαρμογές",
        "code": "ΜΠΠΛΑΝΕ01",
        "mandatory": false,
        "hours": 3,
        "ects": 5,
        "professor": [],
        "description" : "Το μάθημα δεν διαθέτει περιγραφή"
      }
    ]
  }
]